Repository: NerdyDuck/NerdyDuck.Scheduler
Catalog: src/Scheduler/Strings/*/Resources.resw
Source language: en_us
Languages: de_de

# Global_ScheduleType_None
source: Schedule type 'None' is not allowed.
de_de: Zeitplan-Typ 'None' ist nicht erlaubt.

# ScheduledTask_AssertActive_NotInit
source: Object is not initialized.
de_de: Object ist nicht initialisiert.

# ScheduledTask_ReadXml_MissingElement
source: The '{0}' element is missing or empty.
de_de: Element '{0}' fehlt oder ist leer.

# Scheduler_AssertInterval_Negative
source: Interval may not be negative.
de_de: Das Intervall darf nicht negativ sein.

# Scheduler_Stop_Timeout
source: Timeout has elapsed, but at least one scheduled task is still active.
de_de: Der Timeout ist abgelaufen, aber mindestens eine geplante Aufgabe ist noch aktiv.

# Scheduler_Stop_TimeoutNegative
source: Timeout may not be negative.
de_de: Timeout darf nicht negativ sein.

# Schedule_AssertDayInMonth
source: Day in month is smaller than -31 or greater than 31.
de_de: Monats-Tag darf nicht kleiner als -31 oder grösser als 31 sein.

# Schedule_AssertDayMonthInterval
source: Interval must be positive.
de_de: Das Intervall muss positiv sein.

# Schedule_AssertInitialized
source: Object is not initialized.
de_de: Objekt ist nicht initialisiert.

# Schedule_AssertMonths_NoMonths
source: No active months specified.
de_de: Keine aktiven Monate angegeben.

# Schedule_AssertStartTime
source: Start time is either negative or greater than 24 hours.
de_de: Die Start-Uhrzeit ist entweder negativ oder grösser als 24 Stunden.

# Schedule_AssertTimeSpanInterval
source: Interval may not be negative.
de_de: Das Intervall darf nicht negativ sein.

# Schedule_AssertWeekDay_NoWeekDay
source: No week day specified.
de_de: Kein Wochentag angegeben.

# Schedule_AssertWeekDay_TooManyWeekDays
source: More than one week day specified.
de_de: Mehr als ein Wochentag angegeben.

# Schedule_ParseEnumAttribute_InvalidAttribute
source: The '{0}' attribute is invalid or empty.
de_de: Attribut '{0}' ist leer oder ungültig.

# Schedule_ReadXml_MissingAttribute
source: The '{0}' attribute is missing.
de_de: Attribut '{0}' fehlt.

# Schedule_ReadXml_NoAttributes
source: Schedule element has no attributes.
de_de: Schedule-Element hat keine Attribute.
